import { ICamera } from "../components/pages/Main/types";

export const initialCamera: ICamera = {
  id: "",
  online: true,
  title: "",
  defectsCount: 0,
  uptime: "",
  defects: [],
  link: "",
};

export const cameras: ICamera[] = [
  {
    id: "0",
    online: true,
    title: "Камера 1",
    link: "https://swagatyt.gg/heatvision1",
    defectsCount: 5,
    uptime: "1д 16ч 3м",
    defects: [
      {
        id: "_d1",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "_d2",
        name: "Скол_test",
        date: "08:21:03 12.03.2025",
      },
      {
        id: "_d3",
        name: "Скол_test_1",
        date: "14:21:03 12.03.2025",
      },
      {
        id: "_d4",
        name: "Скол_test_2",
        date: "19:21:03 12.03.2025",
      },
      {
        id: "_d5",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
    ],
  },
  {
    id: "1",
    online: true,
    title: "Камера 2",
    defectsCount: 30,
    uptime: "1д 16ч 3м",
    link: "https://swagatyt.gg/heatvision2",
    defects: [
      {
        id: "d1",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d2",
        name: "Скол_test",
        date: "08:21:03 12.03.2025",
      },
      {
        id: "d3",
        name: "Скол_test_1",
        date: "14:21:03 12.03.2025",
      },
      {
        id: "d4",
        name: "Скол_test_2",
        date: "19:21:03 12.03.2025",
      },
      {
        id: "d5",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d6",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d7",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d8",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d9",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d10",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d11",
        name: "Сколл",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d12",
        name: "Повреждение",
        date: "14:21:03 12.03.2025",
      },
      {
        id: "d13",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d14",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d15",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d16",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d17",
        name: "Скол_test",
        date: "08:21:03 12.03.2025",
      },
      {
        id: "d18",
        name: "Скол_test_1",
        date: "14:21:03 12.03.2025",
      },
      {
        id: "d19",
        name: "Скол_test_2",
        date: "19:21:03 12.03.2025",
      },
      {
        id: "d20",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d21",
        name: "Скол_5_page",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d22",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d23",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d24",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d25",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d26",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d27",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d28",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d29",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d30",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d31",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d32",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d33",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d34",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d35",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d36",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d37",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d38",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d39",
        name: "Сколл",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d40",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d41",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d42",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d43",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d44",
        name: "Сколл",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d45",
        name: "Скол_9",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d46",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d47",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d48",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d49",
        name: "Сколл",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d50",
        name: "Скол_9",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d51",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d52",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d53",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d54",
        name: "Сколл",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d55",
        name: "Скол_9",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d56",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d57",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d58",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d59",
        name: "Сколл",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "d60",
        name: "Скол_12",
        date: "13:21:03 12.03.2025",
      },
    ],
  },
  {
    id: "3",
    online: false,
    title: "Камера 3",
    link: "https://swagatyt.gg/heatvision1",
    defectsCount: 5,
    uptime: "1д 16ч 3м",
    defects: [
      {
        id: "_d1",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
      {
        id: "_d2",
        name: "Скол_test",
        date: "08:21:03 12.03.2025",
      },
      {
        id: "_d3",
        name: "Скол_test_1",
        date: "14:21:03 12.03.2025",
      },
      {
        id: "_d4",
        name: "Скол_test_2",
        date: "19:21:03 12.03.2025",
      },
      {
        id: "_d5",
        name: "Скол",
        date: "13:21:03 12.03.2025",
      },
    ],
  },
];
